RIET/src/Documents/BoxesOfCustomsFiles/BoxesOfCustomsFiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BoxesOfCustomsFiles</name>
  <posting>Deny</posting>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>DispatchDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ListOfCustomsFiles</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CustomsFiles</name>
    <attributes>
      <name>CustomsFile</name>
      <type>
        <types>DocumentRef.ГТД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CustomsFilesLight</name>
    <attributes>
      <name>CustomsFileLight</name>
      <type>
        <types>DocumentRef.CustomsFilesLight</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/CustomsFilesLight/CustomsFilesLight.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CustomsFilesLight</name>
  <comment>Декларация на товары (легкая версия) / Таможенный приходный ордер</comment>
  <basedOn>Document.Поставка</basedOn>
  <basedOn>Document.ExportShipment</basedOn>
  <basedOn>Document.CustomsFilesLight</basedOn>
  <basedOn>Document.ГТД</basedOn>
  <registerRecords>AccumulationRegister.ExportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>AccumulationRegister.ItemsWithoutCVCDecision</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDeposits</registerRecords>
  <registerRecords>InformationRegister.CustomsFilesOfGoods</registerRecords>
  <registerRecords>AccumulationRegister.QtyOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.НеоплаченныеТПО</registerRecords>
  <registerRecords>InformationRegister.ExpiryDatesOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDepositsToRefund</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>InformationRegister.AdditionalDataOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.ImportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.ResponsiblesForItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьТоваровПоТПО</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceLinesCosts</registerRecords>
  <attributes>
    <name>TypeOfTransaction</name>
    <type>
      <types>EnumRef.TypesOfCustomsFileLightTransaction</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsPost</name>
    <type>
      <types>CatalogRef.CustomsPosts</types>
    </type>
  </attributes>
  <attributes>
    <name>SeqNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SoldTo</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ImportExport</name>
    <type>
      <types>EnumRef.ИмпортЭкспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>PermanentTemporary</name>
    <type>
      <types>EnumRef.PermanentTemporary</types>
    </type>
  </attributes>
  <attributes>
    <name>Regime</name>
    <type>
      <types>CatalogRef.CustomsRegimes</types>
    </type>
  </attributes>
  <attributes>
    <name>PSAContract</name>
    <type>
      <types>CatalogRef.PSAContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrencyRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReleaseDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shipment</name>
    <type>
      <types>DocumentRef.ExportShipment</types>
      <types>DocumentRef.Поставка</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsFile</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsBond</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositAmountToRefund</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоПоГрафеВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaidByCCA</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositRefundTo</name>
    <type>
      <types>EnumRef.CustomsDepositsRefundTo</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ССD</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileHTC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileNetWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Type</name>
      <comment>RGS - Используется для TKG</comment>
      <type>
        <types>CatalogRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Goods</name>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceTotalValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceLine</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>POLine</name>
      <type>
        <types>CatalogRef.СтрокиЗаявкиНаЗакупку</types>
      </type>
    </attributes>
    <attributes>
      <name>DescriptionForCustoms</name>
      <type>
        <types>EnumRef.DescriptionForCustoms</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceCorrectionValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Payments</name>
    <attributes>
      <name>PaymentKind</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaidByCCA</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InTheSetoffCustomsDeposit</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/BoxesOfCustomsFiles/Forms/ФормаДокумента/Module.bsl
//////////////////////////////////////////////////////////////////////////////////////////
// ФОРМА

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	РГСофтКлиент.ПроверитьНеобходимостьЗаписиДокумента(ПараметрыЗаписи.РежимЗаписи, Объект.Проведен, Модифицированность, Отказ);
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ModifiedBy = ПараметрыСеанса.ТекущийПользователь;
	ТекущийОбъект.ModificationDate = ТекущаяДата();
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////////
// CUSTOMS FILES

&НаКлиенте
Процедура CustomsFilesПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.ProcessLevel) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""ProcessLevel"" is empty!",
			, "ProcessLevel", "Объект");
		Возврат;
	КонецЕсли;
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Имя", "ВыборИзBoxOfCustomsFiles"); 
	СтруктураНастройки.Вставить("ProcessLevel", Объект.ProcessLevel);
	CurrentCustomsFiles = РГСофтКлиентСервер.ВыгрузитьКолонкуКоллекцииБезПустыхЗначенийИДублей(Объект.CustomsFiles, "CustomsFile");
	СтруктураНастройки.Вставить("CurrentCustomsFiles", CurrentCustomsFiles);
	СтруктураНастройки.Вставить("CurrentBox", Объект.Ссылка);
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтруктураНастройки", СтруктураНастройки);
	ОткрытьФорму("Документ.ГТД.Форма.ФормаПодбора", СтруктураПараметров, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура CustomsFilesОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив")
		И ВыбранноеЗначение.Количество()
		И ТипЗнч(ВыбранноеЗначение[0]) = Тип("ДокументСсылка.ГТД") Тогда
		
		Для Каждого CustomsFile Из ВыбранноеЗначение Цикл
			
			НоваяСтрока = Объект.CustomsFiles.Добавить();
			НоваяСтрока.CustomsFile = CustomsFile;
			
		КонецЦикла;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура CustomsFilesВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	CurrentCustomsFile = Элемент.ТекущиеДанные.CustomsFile;
	Если ЗначениеЗаполнено(CurrentCustomsFile) Тогда
		ПоказатьЗначение(,CurrentCustomsFile);
	КонецЕсли; 
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////////
// CUSTOMS FILES LIGHT

&НаКлиенте
Процедура CustomsFilesLightПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.ProcessLevel) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Process level"" is empty!",
			, "ProcessLevel", "Объект");
		Возврат;
	КонецЕсли;
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Имя", "ВыборИзBoxOfCustomsFiles"); 
	СтруктураНастройки.Вставить("ProcessLevel", Объект.ProcessLevel);
	CurrentCustomsFilesLight = РГСофтКлиентСервер.ВыгрузитьКолонкуКоллекцииБезПустыхЗначенийИДублей(Объект.CustomsFilesLight, "CustomsFileLight");
	СтруктураНастройки.Вставить("CurrentCustomsFilesLight", CurrentCustomsFilesLight);
	СтруктураНастройки.Вставить("CurrentBox", Объект.Ссылка);
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтруктураНастройки", СтруктураНастройки);
	ОткрытьФорму("Документ.CustomsFilesLight.Форма.ФормаПодбора", СтруктураПараметров, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура CustomsFilesLightОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив")
		И ВыбранноеЗначение.Количество()
		И ТипЗнч(ВыбранноеЗначение[0]) = Тип("ДокументСсылка.CustomsFilesLight") Тогда
		
		Для Каждого CustomsFileLight Из ВыбранноеЗначение Цикл
			
			НоваяСтрока = Объект.CustomsFilesLight.Добавить();
			НоваяСтрока.CustomsFileLight = CustomsFileLight;
			
		КонецЦикла;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура CustomsFilesLightВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	CurrentCustomsFileLight = Элемент.ТекущиеДанные.CustomsFileLight;
	Если ЗначениеЗаполнено(CurrentCustomsFileLight) Тогда
		ПоказатьЗначение(,CurrentCustomsFileLight);
	КонецЕсли; 
	
КонецПроцедуры
